Revit 2024 API
Railing.GetMultistoryStairsPlacementLevels Method
 Gets the ids of the base levels of the stairs upon which this railing is placed.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public ISet<ElementId> GetMultistoryStairsPlacementLevels()
Visual Basic
Public Function GetMultistoryStairsPlacementLevels As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetMultistoryStairsPlacementLevels()
Return Value
 The ids of levels the railing is placed on. The returned set consists of a subset of the base level ids of the corresponding stairs in the MultistoryStairs.
Remarks
 The method is valid only for railings hosted by stairs in MultistoryStairs.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The railing is not hosted by stairs in MultistoryStairs.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace